/* Common buttons */
"OK" = "确定";
"Cancel" = "取消";
"Done" = "完成";
"Back" = "返回";
"Next" = "下一步";
"Skip" = "跳过";
"Retry" = "重试";
"Refresh" = "刷新";
"Delete" = "删除";
"Save" = "保存";

/* Alerts and messages */
"Scrcpy Connection Error" = "Scrcpy 连接错误";
"Detailed Error Information" = "详细错误信息";
"View Details" = "查看详情";
"The connection was terminated due to an error:\n\n%@" = "连接因错误已中断：\n\n%@";
"Status Update" = "状态更新";

/* Global action confirmation */
"Execute Action" = "执行自动化";
"Execute" = "执行";
"Confirm Action" = "确认自动化";
"Are you sure you want to execute '%@'?\n\nAction ID: %@\nDevice Type: %@\nTiming: %@" = "确定要执行‘%@’吗？\n\nAction ID：%@\n设备类型：%@\n执行时机：%@";

/* General navigation */
"Sessions" = "会话";
"Actions" = "自动化";
"New Action" = "新建 Action";
"Edit Action" = "编辑 Action";
"Delete Action" = "删除 Action";
"Duplicate Action" = "复制 Action";
"Copy URL Scheme" = "复制 URL Scheme";
"Delete Session" = "删除会话";
"Save Session" = "保存会话";
"Save Action" = "保存 Action";
"Device*" = "设备*";
"Actions*" = "自动化*";
"Name*" = "名称*";

/* Session create & options */
"Connection Options" = "连接选项";
"VNC Session Options" = "VNC 会话选项";
"ADB Session Options" = "ADB 会话选项";
"Encoder Options" = "编码器选项";
"Video Encoder" = "视频编码器";
"Audio Encoder" = "音频编码器";
"Default Encoder" = "默认编码器";
"Detected Encoders" = "检测到的编码器";
"Detected Audio Encoders" = "检测到的音频编码器";
"Detecting Video Encoders..." = "正在检测视频编码器…";
"Detecting Audio Encoders..." = "正在检测音频编码器…";
"Enter host and port first" = "请先输入主机和端口";
"Volume Scale" = "音量缩放";
"Size:" = "大小：";
"Sync iPhone Size" = "同步 iPhone 尺寸";
"Remote Device" = "远程设备";
"Host Address" = "主机地址";
"Port" = "端口";
"Use Socks Proxy" = "使用 Socks 代理";
"This session will connect through Tailscale network" = "此会话将通过 Tailscale 网络连接";

/* Logs */
"Application Logs" = "应用日志";
"Log Files" = "日志文件";
"Logs Management" = "日志管理";
"Log Files Statistics" = "日志文件统计";
"Current log size:" = "当前日志大小：";
"Total logs size:" = "日志总大小：";
"Total files:" = "文件总数：";
"Total size:" = "总大小：";
"File:" = "文件：";
"Last Modified:" = "最后修改：";
"Empty Log File" = "空日志文件";
"Loading log content..." = "正在加载日志内容…";
"Long press to copy" = "长按复制";
"Start using the app to generate logs." = "开始使用应用以生成日志。";
"Enable logging in settings to start recording logs" = "在设置中启用日志以开始记录";
"Clear" = "清除";
"Clear All" = "全部清除";
"Clear All Logs" = "清除全部日志";
"Clear Old Logs" = "清除旧日志";
"Keep Current Only" = "仅保留当前";
"Delete Log File" = "删除日志文件";
"This will permanently delete all log files. This action cannot be undone!" = "这将永久删除所有日志文件。此操作不可撤销！";
"This will delete all log files except the current one. Are you sure?" = "这将删除除当前日志外的所有日志。确定继续吗？";

/* Tailscale */
"Tailscale" = "Tailscale";
"Tailscale Configuration" = "Tailscale 配置";
"Tailscale Auth Setting" = "Tailscale 授权设置";
"Tailscale Authentication Configured" = "已配置 Tailscale 认证";
"MagicDNS:" = "MagicDNS：";
"Tailscale IPv4:" = "Tailscale IPv4：";
"Tailscale IPv6:" = "Tailscale IPv6：";
"Please ensure you have a Tailscale account and the target device is connected to your Tailscale network." = "请确保你拥有 Tailscale 账户，并且目标设备已经连接到你的 Tailscale 网络。";

/* Status */
"Connected Successfully" = "连接成功";
"Connection Failed" = "连接失败";
"Connection Status" = "连接状态";
"Connection failed. Please check your network settings and try again." = "连接失败。请检查网络设置后重试。";
"Connection Setup Failed" = "连接配置失败";
"Validation Error" = "校验错误";
"Status" = "状态";
"Status Message" = "状态消息";

/* URL scheme */
"URL Scheme Connection" = "URL Scheme 连接";
"URL Scheme Copied" = "URL Scheme 已复制";
"URL Scheme has been copied to clipboard:\n\n%@" = "URL Scheme 已复制到剪贴板：\n\n%@";

/* Session & action naming */
"Session Name" = "会话名称";
"Select Device" = "选择设备";
"Action Name" = "自动化名称";
"Name Your Action" = "为自动化命名";
"Action name is required" = "需要填写自动化名称";
"Action name looks good" = "自动化名称可用";
"Action configured" = "自动化已配置";

/* Action configuration */
"Execution Timing" = "执行时机";
"Wait" = "等待";
"Delay Time" = "延迟时间";
"seconds" = "秒";
"VNC Quick Actions" = "VNC 快捷自动化";
"Quick Actions" = "快捷自动化";
"ADB Actions" = "ADB 自动化";
"Configure Actions" = "配置自动化";
"Send Key Event" = "发送按键事件";
"Select PC Key" = "选择电脑按键";
"Select Key" = "选择按键";
"Search keys..." = "搜索按键…";
"Selected Keys:" = "已选按键：";
"Drag to reorder" = "拖动以重新排序";
"Modifiers (Optional)" = "修饰键（可选）";
"Configure a sequence of keys to send to the device" = "配置要发送到设备的按键序列";
"Configure a sequence of keys to send to the VNC device" = "配置要发送到 VNC 设备的按键序列";
"Key interval:" = "按键间隔：";
"Command interval:" = "命令间隔：";
"Commands:" = "命令：";
"Input Keys Configuration" = "输入按键配置";
"VNC Input Keys Configuration" = "VNC 输入按键配置";
"Shell Commands Configuration" = "Shell 命令配置";
"Enter shell commands to execute on the Android device" = "输入要在 Android 设备上执行的 Shell 命令";
"Common ADB Shell Examples" = "常用 ADB Shell 示例";
"One command per line" = "每行一条命令";
"Examples" = "示例";
"Please enter at least one shell command" = "请至少输入一条 Shell 命令";
"Please configure keys for Input Keys action" = "请为“输入按键”自动化配置按键";
"Please configure at least one key" = "请至少配置一个按键";
"Select actions to perform on the VNC device" = "选择要在 VNC 设备上执行的自动化";
"Select at least one action to perform when executing this action" = "执行该自动化时请至少选择一个动作";
"Choose a device to associate with this action" = "选择要关联到该自动化的设备";
"Choose when to execute the actions after connection" = "选择连接后何时执行自动化";

/* ADB keys management */
"Manage ADB Keys" = "管理 ADB 密钥";
"Generate New Keys" = "生成新密钥";
"Generate New Key Pair" = "生成新的密钥对";
"Export Keys" = "导出密钥";
"ADB Keys Directory" = "ADB 密钥目录";
"ADB Managements" = "ADB 管理";
"Send Files Default Path" = "文件发送默认路径";
"Send Files Path" = "文件发送路径";
"Default Path" = "默认路径";
"Quick Select" = "快速选择";
"Remote path" = "远程路径";
"Reset to Default" = "重置为默认";
"Private Key (adbkey)" = "私钥（adbkey）";
"Public Key (adbkey.pub)" = "公钥（adbkey.pub）";
"Clear Pairing History" = "清除配对历史";
"Clear Persistent State" = "清除持久化状态";
"This will permanently delete all pairing history. This action cannot be undone." = "这将永久删除所有配对历史。此操作不可撤销。";

/* Pairing */
"Pair ADB with Pairing Code" = "使用配对码进行 ADB 配对";
"Pairing Information" = "配对信息";
"Recent Pairing History" = "最近配对记录";
"Tap Next in the top-right corner when ready" = "准备好后点击右上角“下一步”";
"Please create a session first in the Sessions tab" = "请先在“会话”标签中创建会话";

/* About */
"About Scrcpy Remote" = "关于 Scrcpy Remote";
"Settings" = "设置";
"General" = "通用";
"Appearance" = "外观";
"System" = "跟随系统";
"Letters" = "字母";
"Numbers" = "123";
"Navigation" = "导航";
"Hardware" = "硬件";
"Media" = "媒体";
"Control" = "控制";
"Modifiers" = "修饰键";
"Others" = "其他";
"Function" = "功能";
"Symbols" = "符号";
"Ctrl" = "Ctrl";
"Alt" = "Alt";
"Shift" = "Shift";
"Cmd" = "Command";
"Dark" = "深色";
"Light" = "浅色";
"Background Active" = "后台保持活跃";
"1 minute" = "1 分钟";
"5 minutes" = "5 分钟";
"10 minutes" = "10 分钟";
"30 minutes" = "30 分钟";
"1 hour" = "1 小时";
"Always" = "始终";
"Live Activity in Dynamic Island" = "在灵动岛显示实况";
"Auto Reconnect When Foregrounded" = "回到前台时自动重连";
"Debug Live Activity" = "调试实况活动";
"Enable Log Recording" = "启用日志记录";
"(%d files)" = "(%d 个文件)";

/* Session Create */
"Session Name (Optional)" = "会话名称（可选）";
"Host or vnc://host or adb://host" = "主机（或使用 vnc://host 或 adb://host）";
"Force Switch to VNC mode" = "强制切换为 VNC 模式";
"Connect over Tailscale" = "通过 Tailscale 连接";
"VNC User (Optional)" = "VNC 用户名（可选）";
"VNC Password" = "VNC 密码";
"Video Codec" = "视频编码格式";
"Audio Codec" = "音频编码格式";
"Default" = "默认";
"Max FPS, Default: 60" = "最大帧率，默认：60";
"Enable Audio (Android 11+)" = "启用音频（Android 11+）";
"Enable Clipboard Sync" = "启用剪贴板同步";
"Disable on rooted devices or custom ROMs if the connection drops immediately after connect (clipboard SecurityException)." = "Root 设备或定制 ROM 上若连接后立即断开（剪贴板 SecurityException），请关闭此项。";
"Turn Remote Screen Off After Connected" = "连接后关闭远程屏幕";
"Lock Remote Screen After Disconnected (Press Power)" = "断开后锁定远程屏幕（按电源键）";
"No Cleanup After Disconnected (Keep Screen State)" = "断开后不清理（保持屏幕状态）";
"Keep Remote Device Awake During Use" = "使用期间保持设备唤醒";
"Display ID" = "显示器 ID";
"Start New Display" = "启动新的显示";
"Width" = "宽度";
"Height" = "高度";
"Display DPI" = "显示 DPI";
"Max Screen Size" = "最大屏幕尺寸";
"Bit Rate, Default: 4M or 4000K" = "码率，默认：4M 或 4000K";
"Compress Level" = "压缩级别";
"Quality Level" = "质量级别";
"Force Connect ADB Forward" = "强制使用 ADB 转发连接";
"Create Session" = "创建会话";
"Edit Session" = "编辑会话";
"Connect Session" = "连接会话";
"Duplicate Session" = "复制会话";
"Select Video Encoder" = "选择视频编码器";
"Select Audio Encoder" = "选择音频编码器";
"Enter custom encoder name" = "输入自定义编码器名称";
"Connecting to %@:%d" = "正在连接 %@:%d";
"Detection Failed" = "检测失败";
"Failed to detect encoders" = "检测编码器失败";
"Failed to detect encoders. Please check your connection and try again." = "检测编码器失败。请检查连接后重试。";
"Diagnostic info:" = "诊断信息：";
"Tailscale Auth" = "Tailscale 认证";
"Refresh Encoders" = "刷新编码器";

/* Validation messages */
"Please enter a valid host address." = "请输入有效的主机地址。";
"Please enter a port number." = "请输入端口号。";
"Please enter a valid port number (1-65535)." = "请输入有效的端口号（1-65535）。";
"Please enter a VNC password." = "请输入 VNC 密码。";
"Please enter a valid display width." = "请输入有效的显示宽度。";
"Please enter a valid display height." = "请输入有效的显示高度。";
"Please enter a valid display DPI." = "请输入有效的显示 DPI。";
"Please enter a valid max FPS value." = "请输入有效的最大帧率。";
"Please enter a valid max screen size." = "请输入有效的最大屏幕尺寸。";
"Tailscale authentication is required but not configured." = "需要 Tailscale 认证，但尚未配置。";
"VNC Client Implementation:" = "VNC 客户端实现：";
"Additionally, this app has built-in Tailscale tsnet module, which allows you to establish a virtual network between the app and your target service through Tailscale, then connect to it." = "另外，本应用内置 Tailscale tsnet 模块，可通过 Tailscale 在应用与目标服务间建立虚拟网络，然后进行连接。";
"For detailed usage help, please check:" = "详细使用帮助请参阅：";
"→ Tailscale Usage Guide" = "→ Tailscale 使用指南";
"→ LibVNCClient Documentation" = "→ LibVNCClient 文档";
"→ Join Our Telegram Channel" = "→ 加入我们的 Telegram 频道";
"Tips:" = "小贴士：";
"To pair your Android device for wireless ADB debugging:" = "使用无线 ADB 调试为 Android 设备配对：";
"1. Open Android Settings" = "1. 打开 Android 设置";
"2. Go to Developer Options" = "2. 进入 开发者选项";
"3. Enable Wireless Debugging" = "3. 启用 无线调试";
"4. Tap 'Pair device with pairing code'" = "4. 点击“使用配对码配对设备”";
"5. Enter the Host:Port and Pairing Code below" = "5. 在下方输入 主机:端口 和 配对码";
"How to Get Auth Key" = "如何获取授权密钥";
"To get your Tailscale Auth Key:" = "获取 Tailscale 授权密钥：";
"1. Visit https://login.tailscale.com/admin/settings/keys" = "1. 访问 https://login.tailscale.com/admin/settings/keys";
"2. Create a new Auth Key" = "2. 创建新的授权密钥";
"3. Copy the key and paste it above" = "3. 复制密钥并粘贴到上方";
"Android" = "Android";
"iOS" = "iOS";
"Unknown" = "未知";

/* Other */
"Networking" = "网络";
"Network Addresses" = "网络地址";
"Request & Support" = "反馈与支持";
"Submit an Issue" = "提交问题";
"Start Activity" = "启动活动";
"Stop Activity" = "停止活动";
"Stop All Activities" = "停止所有活动";
"Update Activity" = "更新活动";
"Start a new scrcpy session by tapping the + button.\nSessions will be saved here for quick access." = "点击右上角 + 按钮开始新的 scrcpy 会话。会话会保存在此处以便快速访问。";
"Start a new scrcpy action by tapping the + button.\nActions are used to start scrcpy sessions and execute custom actions automatically." = "点击右上角 + 按钮创建新的 Scrcpy Action。Action 用于启动 Scrcpy 会话并自动执行自定义动作。";
"Actions are required to create a meaningful automation" = "需要添加 Actions 才能创建有意义的自动化";
"No Scrcpy Sessions" = "没有 Scrcpy 会话";
"No Scrcpy Actions" = "没有 Scrcpy Actions";
"No log files found" = "未找到日志文件";
"No saved devices" = "没有已保存的设备";
"A default name has been generated based on your selections. You can modify it if needed." = "已根据你的选择生成默认名称，你可以根据需要修改。";
"This log file contains no content yet." = "该日志文件尚无内容。";
"This app uses LibVNCClient, a cross-platform C library that provides VNC client functionality. LibVNCClient is part of the LibVNCServer/LibVNCClient project, which is free software licensed under the GPL." = "本应用使用跨平台的 C 库 LibVNCClient 提供 VNC 客户端功能。LibVNCClient 属于 LibVNCServer/LibVNCClient 项目，遵循 GPL 许可。";
"This feature is under development, please wait." = "该功能正在开发中，请稍候";

/* Misc */
"Select the type of action to perform on the Android device" = "选择要在 Android 设备上执行的自动化 Action 类型";
"Please select a device to continue" = "请选择一个设备以继续";
"Please select at least one VNC action" = "请至少选择一个 VNC 自动化";
"No additional configuration needed" = "无需额外配置";
"Enter action name" = "输入 Action 名称";
"%d action(s) selected" = "已选择 %d 个自动化 Actions";
"Execute Immediately" = "立即执行";
"Execute After Delay" = "延迟后执行";
"Wait for Confirmation" = "等待确认";
"Actions will execute right after connection" = "连接后立即执行 Actions";
"Actions will execute after specified delay" = "将在指定延迟后执行 Actions";
"Actions will wait for manual confirmation" = "将等待手动确认后执行";
"Input Keys" = "输入按键";
"Sync Clipboard" = "同步剪贴板";
"Send key combinations to VNC device" = "向 VNC 设备发送按键组合";
"Sync clipboard with VNC device" = "与 VNC 设备同步剪贴板";
"Home Key" = "主页键";
"Switch Key" = "多任务键";
"Shell Commands" = "Shell 命令";
"Execute ADB Home key (keyevent 3)" = "执行 ADB 主页键（keyevent 3）";
"Execute ADB App Switch key (keyevent 187)" = "执行 ADB 应用切换键（keyevent 187）";
"Execute ADB custom key sequence" = "执行 ADB 自定义按键序列";
"Execute ADB shell commands" = "执行 ADB Shell 命令";
"Your action will be saved and ready to use" = "你的 Action 将被保存并可立即使用";
"• Use descriptive names like 'Connect to Dev Server'" = "• 使用有描述性的名称，例如「连接到开发服务器」";
"• Include device name for easy identification" = "• 包含设备名称以便识别";
"• Names are automatically numbered if duplicates exist" = "• 如有重名会自动编号";

/* Test & Debug functionality */
"Test Video Player" = "测试视频播放器";
"Test Video" = "测试视频";
"Start test video first" = "请先启动测试视频";
"Video layer ready (test video playing)" = "视频层已就绪（测试视频正在播放）";
"Test video playing (layer should be available soon)" = "测试视频正在播放（视频层即将可用）";
"No video layer found (try playing the test video)" = "未找到视频层（请尝试播放测试视频）";
"This tool helps you test and debug Live Activity functionality. You can:" = "此工具帮助您测试和调试实况活动功能。您可以：";
"Start/stop test activities" = "启动/停止测试活动";
"Test different device types" = "测试不同的设备类型";
/* VNC Compression and Quality Levels */
"VNC Compression None" = "不压缩";
"VNC Compression Standard" = "标准压缩";
"VNC Compression Maximum" = "最大压缩";
"VNC Quality Lowest" = "最低质量";
"VNC Quality Low" = "低质量";
"VNC Quality Standard" = "标准质量";
"VNC Quality High" = "高质量";
"VNC Quality Highest" = "最高质量";

/* OAuth & Tailscale Settings */
"Configure OAuth to generate auth keys automatically" = "配置 OAuth 以自动生成授权密钥";
"Generate Auth Key via OAuth" = "通过 OAuth 生成授权密钥";
"Generated via OAuth" = "已通过 OAuth 生成";
"Manual Auth Key" = "手动输入授权密钥";
"Paste an auth key from Tailscale admin console:" = "从 Tailscale 管理控制台粘贴授权密钥：";
"OAuth Client ID" = "OAuth 客户端 ID";
"OAuth Client Secret" = "OAuth 客户端密钥";
"Device Tag (required for OAuth)" = "设备标签（OAuth 必需）";
"Save Keys" = "保存密钥";
"Will auto-regenerate when connecting" = "连接时将自动重新生成";
"Benefits of OAuth-generated keys:" = "OAuth 生成密钥的优势：";
"• More secure than long-lived manual keys" = "• 比长期有效的手动密钥更安全";
"• Can be automatically regenerated (up to 90 days each)" = "• 可自动重新生成（每个最长 90 天）";
"• OAuth credentials can generate unlimited keys" = "• OAuth 凭据可生成无限数量的密钥";
"How to create an OAuth client:" = "如何创建 OAuth 客户端：";
"Step 1: Create a Tag" = "步骤 1：创建标签";
"Step 2: Create OAuth Client" = "步骤 2：创建 OAuth 客户端";
"Visit https://login.tailscale.com/admin/acls/visual/tags" = "访问 https://login.tailscale.com/admin/acls/visual/tags";
"Click 'Add Tag' and enter a name like 'scrcpy-remote'" = "点击「添加标签」并输入名称，如「scrcpy-remote」";
"Visit https://login.tailscale.com/admin/settings/trust-credentials" = "访问 https://login.tailscale.com/admin/settings/trust-credentials";
"Click 'Credential' -> 'OAuth'" = "点击「凭据」->「OAuth」";
"Select 'auth_keys' scope with Write permission" = "选择具有写入权限的「auth_keys」范围";
"Select the tag you created (e.g., 'tag:scrcpy-remote')" = "选择你创建的标签（例如「tag:scrcpy-remote」）";
"Click 'Generate credential' and copy the Client ID and Secret" = "点击「生成凭据」并复制客户端 ID 和密钥";
"3. Copy the key and paste it in the Auth Key field above" = "3. 复制密钥并粘贴到上方的授权密钥字段中";

/* Action Creation */
"Select Device for Action" = "为 Action 选择设备";
"Choose a specific device or select a device type to choose later" = "选择特定设备或选择设备类型以稍后选择";
"Or Select Specific Device" = "或选择特定设备";
"Select Later (Any Device of Type)" = "稍后选择（该类型的任意设备）";
"Select at runtime" = "运行时选择";
"Please select a device or device type to continue" = "请选择设备或设备类型以继续";

/* ADB Management */
"ADB Home:" = "ADB 主目录：";
"Clear History" = "清除历史";
"This is a destructive operation!\n\n• Your current ADB keys will be permanently deleted\n• All devices previously authorized with your current keys will lose authorization\n• You will need to re-authorize all devices manually\n• This action cannot be undone\n\nAre you sure you want to generate new ADB keys?" = "这是一个破坏性操作！\n\n• 你当前的 ADB 密钥将被永久删除\n• 之前使用当前密钥授权的所有设备将失去授权\n• 你需要手动重新授权所有设备\n• 此操作无法撤销\n\n确定要生成新的 ADB 密钥吗？";
"Files sent via 'Send Files' action will be pushed to this path on the Android device." = "通过「发送文件」操作发送的文件将被推送到 Android 设备上的此路径。";
"The path must be an absolute path starting with /sdcard/ or similar accessible directory." = "路径必须是以 /sdcard/ 或类似可访问目录开头的绝对路径。";
"Disconnect & Cleanup" = "断开连接并清理";

/* Migration & Help */
"Migrate" = "迁移";
"We found settings from the previous versions. Would you like to migrate them to the new version?" = "我们发现了以前版本的设置。是否要将它们迁移到新版本？";
"Usage Guide" = "使用指南";
"Info" = "信息";
"Instructions" = "说明";
"Content:" = "内容：";
"Current" = "当前";
"Result" = "结果";
"Scrcpy Remote is a remote desktop tool based on VNC/ADB protocols, typically used for connecting to services with public IP addresses or services within the same local network." = "Scrcpy Remote 是一款基于 VNC/ADB 协议的远程桌面工具，通常用于连接具有公网 IP 地址的服务或同一局域网内的服务。";
"If you cannot connect to your service normally, please first check whether the network connection is working properly." = "如果无法正常连接到您的服务，请先检查网络连接是否正常。";
"If you encounter problems and need help while using, you can also join our Telegram Channel." = "如果在使用过程中遇到问题并需要帮助，也可以加入我们的 Telegram 频道。";

/* Special strings with emoji/bullets */
"⚠️ Start test video first" = "⚠️ 请先启动测试视频";
"• Start/stop test activities" = "• 启动/停止测试活动";
"• Test different device types" = "• 测试不同的设备类型";

/* Dump UI Layouts */
"Dump UI Layouts" = "导出 UI 布局";
"Capture and inspect UI hierarchy" = "捕获并检查 UI 层次结构";
"Dumping..." = "正在导出...";
"Downloading..." = "正在下载...";
"Parsing..." = "正在解析...";
"No UI elements found" = "未找到 UI 元素";

/* VNC Audio Streaming */
"Enable Audio Streaming" = "启用音频流";
"Audio Port (Default: VNC Port + 1)" = "音频端口 (默认: VNC端口 + 1)";
"Audio stream will be received from TCP port. Leave empty to use VNC port + 1." = "将从TCP端口接收音频流。留空则使用VNC端口 + 1。";

"Audio Port (Default: 4901)" = "音频端口 (默认: 4901)";
"Receives PCM audio stream over TCP. Default port: 4901" = "通过TCP接收PCM音频流。默认端口: 4901";

"Buffer: %d ms" = "缓冲: %d 毫秒";
"Receives PCM audio over TCP. Increase buffer if audio breaks." = "通过TCP接收PCM音频。如果音频断续，请增加缓冲。";

/* Fit Device Window Size */
"Fit Device Window Size" = "适配设备窗口尺寸";
"Adapt screen to iPhone aspect ratio" = "将屏幕调整为 iPhone 宽高比";
"Confirm" = "确认";
"This will adjust the remote device screen size to match your iPhone's aspect ratio. Continue?" = "这将调整远程设备的屏幕尺寸以匹配您的 iPhone 宽高比。是否继续？";
"Adapt screen to iPhone aspect ratio" = "将屏幕调整为当前窗口宽高比";
"This will adjust the remote device screen size to match your iPhone's aspect ratio. Continue?" = "这将调整远程设备的屏幕尺寸以匹配当前窗口宽高比。是否继续？";

/* ===== 底部浮动 Tab 栏（2026-09-24 新外壳）===== */
"Devices" = "设备";
"Console" = "控制台";

/* ===== Devices 页（2026-09-24 新外壳）===== */
"Add" = "添加";
"Edit" = "编辑";
"Delete Device" = "删除设备";
"Duplicate" = "复制一份";
"Manual" = "手动";
"Connect" = "连接";
"Disconnect" = "断开";
"Saved devices" = "已保存的设备";
"Found" = "已发现";
"Details" = "详情";
"No devices yet" = "还没有设备";
"Pair with code" = "配对码配对";
"Scan LAN" = "扫描局域网";
"Scanning…" = "扫描中…";
"Control your Android devices over Wi-Fi, the frp tunnel, or Tailscale — no desktop required." = "通过 Wi-Fi、frp 隧道或 Tailscale 控制你的安卓设备，不需要电脑。";
"Tap + to add a device: pairing code, LAN scan, or manual IP / port." = "点 + 添加设备：配对码、扫描局域网，或手动填 IP / 端口。";
"Scans this iPhone's Wi-Fi subnet for Android devices listening on the ADB port (5555)." = "扫描本机 Wi-Fi 网段里监听 ADB 端口（5555）的安卓设备。";
"No devices found. Make sure the phone is on the same Wi-Fi and wireless debugging (adb tcpip 5555) is on." = "没扫描到设备。确认手机连的是同一个 Wi-Fi，且已开启无线调试（adb tcpip 5555）。";

/* ===== 连接状态药丸（2026-09-24 新外壳）===== */
"Connected" = "已连接";
"Connecting" = "连接中";
"Idle" = "空闲";
"Failed" = "失败";

/* ===== Console 页（2026-09-24 新外壳）===== */
"Tools" = "工具";
"For authorized devices only." = "仅限已授权的设备。";
"No connected device" = "没有已连接的设备";
"Connect an Android device on the Devices tab first." = "先在「设备」页连接一台安卓设备。";
"Switch device" = "切换设备";
"No saved devices." = "还没有保存的设备。";
"Device info" = "设备信息";
"OS, CPU, display, battery, storage…" = "系统、CPU、显示、电池、存储…";
"List apps; uninstall, force stop, or launch." = "列出应用；卸载、强制停止或启动。";
"Browse device storage; upload or download." = "浏览手机存储；上传或下载文件。";
"Live mirror with touch control." = "实时投屏，支持触摸操作。";
"Screen mirror" = "屏幕镜像";
"Screen snapshot" = "屏幕截图";
"Screencap and MP4 recording." = "截屏与 MP4 录制。";
"Quick input" = "快速输入";
"Send text and common remote keys." = "发送文字与常用遥控键。";
"ADB shell" = "ADB 命令行";
"Run presets and custom shell commands." = "跑预置命令或自定义 shell 命令。";
"Logs" = "日志";
"Live logcat with level filters." = "实时 logcat，可按级别过滤。";
"Saved command sequences for this device." = "这台设备保存的命令序列。";

/* ===== Device info 页（2026-09-24 新外壳）===== */
"Device" = "设备";
"Memory" = "内存";
"Battery" = "电池";
"Display" = "显示";
"Level" = "电量";
"Model" = "型号";
"Brand" = "品牌";
"Serial" = "序列号";
"Cores" = "核心数";
"Total" = "总计";
"Available" = "可用";
"Temperature" = "温度";
"Health" = "健康度";
"Size" = "分辨率";
"Density" = "像素密度";
"Internal" = "内部存储";
"Reading device info…" = "正在读取设备信息…";

/* ===== 电池状态（走 LocalizedStringKey 查表）（2026-09-24 新外壳）===== */
"Charging" = "充电中";
"Discharging" = "放电中";
"Not charging" = "未充电";
"Full" = "已充满";
"Good" = "良好";
"Overheat" = "过热";
"Dead" = "已损坏";
"Over voltage" = "过压";
"Unspecified failure" = "未知故障";
"Cold" = "过冷";
"charging" = "充电中";
"not charging" = "未充电";
"full" = "已充满";

/* ===== Apps 页（2026-09-24 新外壳）===== */
"All" = "全部";
"User" = "用户";
"Launchable" = "可启动";
"Open" = "打开";
"Uninstall" = "卸载";
"Force stop" = "强制停止";
"Extract APK" = "提取 APK";
"Copy package name" = "复制包名";
"Package detail" = "应用详情";
"No packages" = "没有应用";
"Reading package list…" = "正在读取应用列表…";

/* ===== Files 页（2026-09-24 新外壳）===== */
"Files" = "文件";
"Storage" = "存储";
"Download" = "下载";
"Pictures" = "图片";
"Movies" = "影片";
"Empty" = "这里还是空的";
"Create" = "创建";
"New folder" = "新建文件夹";
"Folder name" = "文件夹名称";
"Copy path" = "复制路径";
"Update Available" = "发现新版本";
"Update Now" = "立即更新";
"Later" = "稍后";
"A new build (%@) is available. Update now?" = "发现新构建（%@），现在更新吗？";
"Discover Devices" = "发现设备";
"Ready" = "就绪";
"Rescan" = "重新扫描";
"frpc online list" = "frpc 在线设备";
"Enter the frps admin account (webServer) to list online devices — saved once, used for every scan." = "填写 frps 管理接口（webServer）的账号即可列出在线设备 —— 只需填一次，之后每次扫描自动使用。";
"frps admin user" = "frps 管理账号";
"frps admin password" = "frps 管理密码";
"via frpc tunnel" = "经 frpc 隧道";
"Getting frpc online devices…" = "正在获取 frpc 在线设备…";
"Scanning LAN…" = "正在扫描局域网…";
"Identifying devices…" = "正在识别设备…";
"No devices found" = "没有发现设备";
"No devices found. Make sure the phone is on the same Wi-Fi (adb tcpip 5555) or frpc is online." = "没有发现设备。请确认手机在同一 WiFi（已 adb tcpip 5555）或 frpc 在线。";
"need frps admin account" = "需要填写 frps 管理账号";
"frps admin unreachable" = "连不上 frps 管理接口";
"frps not configured" = "未配置 frps";
"bad frps address" = "frps 地址无效";
"Rename" = "重命名";
"Rename Device" = "重命名设备";
"Device name" = "设备名称";
"Remembered for this device (model + serial suffix). Leave empty to reset." = "按设备记住（型号 + 序列号后4位）。留空则恢复默认名。";
